import datetime

items_data = ['', '編輯', '分類', '子分類', '上班棟別', '實際量測棟別', '量測日期', '量測時段', '進入門禁時間', '員工工號', '姓名', '公司名稱', '班別代碼', 'BU', '舊廠處代碼', '部門代碼', '組織代碼', '組織(中文)', '量測類別', '體溫分類', 
'體溫', '聯絡電話', '備註', '建檔人員', '建檔日期', '修改人員', '修改日期']
employee_datas = [
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:07:59', 'D4677', '蔡柏謙', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.5', '84584', '', 'D4677', '2021-07-07 12:29:00', '', ''], 
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:07:59', 'D4677', '蔡柏謙', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式( 額溫)', '無異常', '36.5', '84584', '', 'D4677', '2021-07-07 08:29:32', '', ''],
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:41:36', 'C8807', '蘇緣峻', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.5', '84562', '', 'C8807', '2021-07-07 08:43:20', '', ''],
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:41:36', 'C8807', '蘇緣峻', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.5', '84562', '', 'C8807', '2021-07-07 12:01:23', '', ''], 
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:14:18', 'F9084', '邱昱儒', 'ASEK', 'YR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.5', '84589', '', 'F9084', '2021-07-07 08:36:15', '', ''], 
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:14:18', 'F9084', '邱昱儒', 'ASEK', 'YR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.6', '84589', '', 'F9084', '2021-07-07 12:02:58', '', ''], 
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:51:13', 'K09857', '陳至怡', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.7', '', '', 'K09857', '2021-07-07 08:53:07', '', ''], 
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 08:51:13', 'K09857', '陳至怡', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', ' 接觸式(耳溫)', '無異常', '36.7', '', '', 'K09857', '2021-07-07 13:18:03', '', ''], 
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 07:48:15', 'K09865', '吳光明', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.7', '', '', 'K09865', '2021-07-07 07:53:16', '', ''], 
    ['', '', 'ASE', '辦公室', 'K6B', 'K6B', '2021/7/7', '', '2021/7/7 上午 07:48:15', 'K09865', '吳光明', 'ASEK', 'RR', 'TRD', '5900', '5910', '81750', '測試軟體應用一部_幕僚組', '非接觸式(額溫)', '無異常', '36.7', '', '', 'K09865', '2021-07-07 12:04:26', '', '']
]
del items_data[0:2]

real_data = []
for data in employee_datas:
    del data[0:2]
    # data_dict = {}
    # for i in range(len(items_data)):
    #     if items_data[i] == '量測日期' or items_data[i] == '進入門禁時間' or items_data[i] == '員工工號' or items_data[i] == '姓名':
    #         data_dict[items_data[i]] = data[i]
    # real_data.append(data_dict)
    data_dict = {items_data[i]: data[i] for i in range(len(items_data)) if items_data[i] == '量測日期' or items_data[i] == '進入門禁時間' or items_data[i] == '員工工號' or items_data[i] == '姓名' }
    real_data.append(data_dict)

print(real_data)
datetime_dt = datetime.datetime.today()# 獲得當地時間
datetime_str = datetime_dt.strftime("%Y-%m-%d-%H-%M-%S")  # 格式化日期
file_name = "../output_data/{}.txt".format(datetime_str)

with open(file_name, 'w', encoding="utf-8") as f:
    for item in real_data:
        # f.write("%s\n" % item)
        f.write("量測日期: {0} 進入門禁時間: {1} 員工工號: {2} 姓名: {3} \n".format(item['量測日期'],item['進入門禁時間'],item['員工工號'],item['姓名']))


